In [2]:
# Simple Linear Regression

# Importing the libraries
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd

# Importing the dataset
dataset = pd.read_csv('../data/lob/Salary_Data.csv')

In [3]:
dataset.shape

(30, 2)

In [4]:
dataset.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [5]:

x = dataset.iloc[:, :-1].values # pick all rows, all columns except -1
y = dataset.iloc[:, 1].values # pick all rows, first column

In [6]:
#boston.target contains the housing prices.
dataset[:1]

   YearsExperience   Salary
0              1.1  39343.0

In [7]:
#Handling Missing ValuesÂ¶
dataset.isnull().sum()

YearsExperience    0
Salary             0
dtype: int64

In [8]:
dataset['YearsExperience'].describe()

count    30.000000
mean      5.313333
std       2.837888
min       1.100000
25%       3.200000
50%       4.700000
75%       7.700000
max      10.500000
Name: YearsExperience, dtype: float64